fluig/WS-UPDATEFOLDER

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.dm.ecm.technology.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:updateFolder>
         <username>usuario</username>
         <password>usuario</password>
         <companyId>1</companyId>
         <Document>
            <!--Zero or more repetitions:-->
            <item>
               <accessCount>0</accessCount>
               <activeVersion>true</activeVersion>
               <additionalComments/>
               <allowMuiltiCardsPerUser>true</allowMuiltiCardsPerUser>
               <approvalAndOr>false</approvalAndOr>
               <approved>true</approved>
               <colleagueId>kelvin.musselli</colleagueId>
               <companyId>1</companyId>
               <crc>0</crc>
               <createDate>2019-06-11T00:00:00-03:00</createDate>
               <createDateInMilliseconds>1560222000000</createDateInMilliseconds>
               <datasetName/>
               <deleted>false</deleted>
               <documentDescription>Herança</documentDescription>
               <documentId>594</documentId>
               <documentType>1</documentType>
               <documentTypeId/>
               <downloadEnabled>true</downloadEnabled>
               <draft>false</draft>
               <expirationDate>2019-06-11T00:00:00-03:00</expirationDate>
               <expires>false</expires>
               <forAproval>false</forAproval>
               <iconId>0</iconId>
               <imutable>false</imutable>
               <indexed>true</indexed>
               <inheritSecurity>false</inheritSecurity>
               <internalVisualizer>false</internalVisualizer>
               <isEncrypted>false</isEncrypted>
               <keyWord/>
               <languageId>pt_BR</languageId>
               <lastModifiedDate>2019-06-11T00:00:00-03:00</lastModifiedDate>
               <metaListId>0</metaListId>
               <metaListRecordId>0</metaListRecordId>
               <onCheckout>false</onCheckout>
               <parentDocumentId>593</parentDocumentId>
               <pdfRenderEngine/>
               <permissionType>0</permissionType>
               <phisicalFile/>
               <phisicalFileSize>0.0</phisicalFileSize>
               <privateDocument>false</privateDocument>
               <protectedCopy>false</protectedCopy>
               <publisherId>kelvin.musselli</publisherId>
               <restrictionType>0</restrictionType>
               <rowId>0</rowId>
               <securityLevel>0</securityLevel>
               <siteCode>Fluig</siteCode>
               <topicId>1</topicId>
               <translated>false</translated>
               <UUID>6B79A7DC-1811-45B0-94B2-CE894F4065BC</UUID>
               <updateIsoProperties>false</updateIsoProperties>
               <userNotify>false</userNotify>
               <validationStartDate>2019-06-11T00:00:00-03:00</validationStartDate>
               <version>1000</version>
               <versionDescription/>
               <volumeId>Default</volumeId>
            </item>
         </Document>
         <security>
			<item>
                    <attributionType>1</attributionType>
                    <attributionValue>kelvin.musselli</attributionValue>
                    <companyId>1</companyId>
                    <documentId>594</documentId>
                    <downloadEnabled>true</downloadEnabled>
                    <permission>true</permission>
                    <securityLevel>2</securityLevel>
                </item>
                <item>
                    <attributionType>1</attributionType>
                    <attributionValue>dev</attributionValue>
                    <companyId>1</companyId>
                    <documentId>594</documentId>
                    <downloadEnabled>true</downloadEnabled>
                    <permission>true</permission>
                    <securityLevel>2</securityLevel>
                </item>
                <item>
                    <attributionType>1</attributionType>
                    <attributionValue>raoni.demarchi</attributionValue>
                    <companyId>1</companyId> 
                    <documentId>594</documentId>
                    <downloadEnabled>true</downloadEnabled>
                    <permission>true</permission>
                    <securityLevel>2</securityLevel>
                </item>
         </security>
         <Approvers>
          
         </Approvers>
      </ws:updateFolder>
   </soapenv:Body>
</soapenv:Envelope>